# Introduction to Pandas

Pandas เป็น Python package ยอดนิยมสำหรับการทำ data science โดยข้อดีหลักๆของมันคือมันสามารถทำ data manipulation และ data analysis ได้ง่าย

[![](https://colab.research.google.com/assets/colab-badge.svg)](https://colab.research.google.com/drive/1FpWjpPEvJgCfo3XmkY-NPfRSNcmjDHrn?usp=sharing)

In [1]:
import pandas as pd

import warnings
warnings.filterwarnings('ignore')

## Pandas vs. Excel

ใน Excel เมื่อคุณมีข้อมูลที่มากกว่า 10,000 แถว โปรแกรมมันจะเริ่มช้าลง และ Excel จะจำกัดจำนวนแถวของข้อมูลใน 1 spreadsheet โดยมากที่สุดคือ 1,048,576 แถว เนื่องจากข้อจำกัดของหน่วยความจำ

[ข้อกำหนดและขีดจำกัดของ Excel](https://support.microsoft.com/th-th/office/%e0%b8%82%e0%b9%89%e0%b8%ad%e0%b8%81%e0%b8%b3%e0%b8%ab%e0%b8%99%e0%b8%94%e0%b9%81%e0%b8%a5%e0%b8%b0%e0%b8%82%e0%b8%b5%e0%b8%94%e0%b8%88%e0%b8%b3%e0%b8%81%e0%b8%b1%e0%b8%94%e0%b8%82%e0%b8%ad%e0%b8%87-excel-1672b34d-7043-467e-8e27-269d656771c3?redirectSourcePath=%252fen-us%252farticle%252fExcel-specifications-and-limits-ca36e2dc-1f09-4620-b726-67c00b05040f&ui=th-TH&rs=th-TH&ad=TH)

In [2]:
!wget https://github.com/opalchonlapat/sample-data/raw/master/sample_big_dataset.zip
!unzip sample_big_dataset.zip

--2021-04-02 04:50:06--  https://github.com/opalchonlapat/sample-data/raw/master/sample_big_dataset.zip
Resolving github.com (github.com)... 192.30.255.113
Connecting to github.com (github.com)|192.30.255.113|:443... connected.
HTTP request sent, awaiting response... 302 Found
Location: https://raw.githubusercontent.com/opalchonlapat/sample-data/master/sample_big_dataset.zip [following]
--2021-04-02 04:50:06--  https://raw.githubusercontent.com/opalchonlapat/sample-data/master/sample_big_dataset.zip
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 185.199.111.133, 185.199.109.133, 185.199.108.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|185.199.111.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 73705994 (70M) [application/zip]
Saving to: ‘sample_big_dataset.zip’

sample_big_dataset. 100%[===================>]  70.29M   101MB/s    in 0.7s

2021-04-02 04:50:09 (101 MB/s) - ‘sample_big_dataset.zip’ saved [73705994/73705994]

Archive:  sample_big_dataset.zip
  inflating: sample_big_dataset.csv

In [3]:
%%time
sample_df = pd.read_csv('sample_big_dataset.csv')

CPU times: user 23.1 s, sys: 3.52 s, total: 26.6 s
Wall time: 26.7 s

In [4]:
print(f"Number of rows and columns of dataset: {sample_df.shape}")
sample_df.head()

Number of rows and columns of dataset: (2000000, 100)

     0    1    2    3    4    5    6  ...   93   94   95   96   97   98   99
0  baz  baz  bar  bar  bar  foo  bar  ...  foo  foo  foo  baz  baz  bar  foo
1  bar  bar  baz  bar  foo  bar  foo  ...  bar  bar  foo  foo  foo  baz  bar
2  baz  bar  bar  bar  bar  foo  baz  ...  bar  foo  foo  baz  bar  foo  baz
3  foo  bar  baz  bar  foo  baz  baz  ...  baz  bar  baz  bar  bar  bar  bar
4  bar  bar  bar  baz  foo  baz  baz  ...  foo  foo  foo  baz  bar  bar  foo

[5 rows x 100 columns]

## Pandas Data Structures

### Series

คือ array ที่มี 1 มิติ โดยสามารถเก็บข้อมูลได้ทุกประเภท

In [5]:
ser = pd.Series([1, 2, 3])

In [6]:
print(f"Data dimension: {ser.ndim}")
print(f"Data shape: {ser.shape}")
ser

Data dimension: 1
Data shape: (3,)

0    1
1    2
2    3
dtype: int64

### DataFrame

คือ array ที่มี 2 มิติ โดยแต่ละ columns ก็อาจจะเป็นชนิดของข้อมูลที่แตกต่างกันได้

In [7]:
data = {'name': ['John', 'Jo', 'Joe'],
        'age': [20, 25, 30],
        'absent': [False, False, True]}
df = pd.DataFrame(data)

In [8]:
print(f"Data dimension: {df.ndim}")
print(f"Data shape: {df.shape}")
df

Data dimension: 2
Data shape: (3, 3)

   name  age  absent
0  John   20   False
1    Jo   25   False
2   Joe   30    True

## Read and Write data

Pandas สามารถอ่านและเขียนข้อมูลได้หลากหลายประเภท ไม่ว่าจะเป็น CSV, JSON, Excel และประเภทอื่นๆอีกมากมาย [Pandas I/O](https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html) โดยใน course intro นี้ เราจะใช้ข้อมูลรถมือสองของเว็บไซต์ตลาดรถ www.taladrod.com ที่เป็นไฟล์ประเภท csv มาเรียนรู้การใช้ Pandas กัน

In [9]:
df = pd.read_csv('https://raw.githubusercontent.com/cstorm125/viztech/master/data/taladrod.csv')

In [10]:
df.to_csv('DataFrame.csv')

In [11]:
df

            id   brand  series  ... subscribers scraped_date  removed_date
0      2210000   HONDA    JAZZ  ...      1047.0   2019-05-22           NaN
1      2210001  TOYOTA  ESTIMA  ...       182.0   2019-05-22           NaN
2      2210009   HONDA    JAZZ  ...      1047.0   2019-05-22           NaN
3      2210012    FORD  RANGER  ...       760.0   2019-05-22           NaN
4      2210016  TOYOTA  SOLUNA  ...       699.0   2019-05-22           NaN
...        ...     ...     ...  ...         ...          ...           ...
14032  2232877   HONDA   CIVIC  ...      1614.0   2019-05-28           NaN
14033  2232878  TOYOTA   CAMRY  ...      1469.0   2019-05-28           NaN
14034  2232879  TOYOTA   CAMRY  ...      1469.0   2019-05-28           NaN
14035  2232880   HONDA    JAZZ  ...       825.0   2019-05-28           NaN
14036  2232881   HONDA   CIVIC  ...      1147.0   2019-05-28           NaN

[14037 rows x 17 columns]

In [12]:
df.head()

        id   brand  series  ... subscribers scraped_date  removed_date
0  2210000   HONDA    JAZZ  ...      1047.0   2019-05-22           NaN
1  2210001  TOYOTA  ESTIMA  ...       182.0   2019-05-22           NaN
2  2210009   HONDA    JAZZ  ...      1047.0   2019-05-22           NaN
3  2210012    FORD  RANGER  ...       760.0   2019-05-22           NaN
4  2210016  TOYOTA  SOLUNA  ...       699.0   2019-05-22           NaN

[5 rows x 17 columns]

In [13]:
df.tail()

            id   brand series  ... subscribers scraped_date  removed_date
14032  2232877   HONDA  CIVIC  ...      1614.0   2019-05-28           NaN
14033  2232878  TOYOTA  CAMRY  ...      1469.0   2019-05-28           NaN
14034  2232879  TOYOTA  CAMRY  ...      1469.0   2019-05-28           NaN
14035  2232880   HONDA   JAZZ  ...       825.0   2019-05-28           NaN
14036  2232881   HONDA  CIVIC  ...      1147.0   2019-05-28           NaN

[5 rows x 17 columns]

In [14]:
df.sample()

           id   brand    series  ... subscribers scraped_date  removed_date
7931  2225896  TOYOTA  FORTUNER  ...      1254.0   2019-05-22           NaN

[1 rows x 17 columns]

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14037 entries, 0 to 14036
Data columns (total 17 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id                14037 non-null  int64
 1   brand             14037 non-null  object
 2   series            14037 non-null  object
 3   model             14037 non-null  object
 4   gen               14037 non-null  object
 5   year              14037 non-null  float64
 6   color             14037 non-null  object
 7   gear              14037 non-null  object
 8   gas               891 non-null    object
 9   sales_price       14037 non-null  object
 10  original_price    121 non-null    object
 11  market_price      6153 non-null   object
 12  description       14037 non-null  object
 13  contact_location  14037 non-null  object
 14  subscribers       14028 non-null  float64
 15  scraped_date      14037 non-null  object
 16  removed_date      1590 non-null   object
dtypes: float64(2), int64(1), object(14)
memory usage: 1.8+ MB

## Selection by position or label

### Getting

เลือก 1 element

In [16]:
ser[0]

1

เลือก subset ของ DataFrame

In [17]:
df[1:3]

        id   brand  series  ... subscribers scraped_date  removed_date
1  2210001  TOYOTA  ESTIMA  ...       182.0   2019-05-22           NaN
2  2210009   HONDA    JAZZ  ...      1047.0   2019-05-22           NaN

[2 rows x 17 columns]

### Selecting

เลือกโดย Position: เป็นการเลือก single value โดยแถวและคอลัมน์

In [18]:
df.iloc[0, 1]

'HONDA'

In [19]:
df.iat[0, 1]

'HONDA'

เลือกโดย Label: เป็นการเลือก single value โดยแถวและคอลัมน์จาก labels

In [20]:
df.loc[0, 'brand']

'HONDA'

In [21]:
df.at[0, 'brand']

'HONDA'

เลือก subset ของ DataFrame

In [22]:
df.iloc[0]

id                                                            2210000
brand                                                           HONDA
series                                                           JAZZ
model                                              1.5 i-VTEC SV (AS)
gen                                                           ปี08-13
year                                                             2014
color                                                           สีขาว
gear                                                      เกียร์ออโต้
gas                                                               NaN
sales_price                                                   488,000
original_price                                                    NaN
market_price                                                      NaN
description         เครดิตดีออกรถ10,000จบครับ\nรับประกันเครื่องเกี...
contact_location                                             กรุงเทพฯ
subscribers                                                      1047
scraped_date                                               2019-05-22
removed_date                                                      NaN
Name: 0, dtype: object

In [23]:
df.iloc[0:2, 0:2]

        id   brand
0  2210000   HONDA
1  2210001  TOYOTA

In [24]:
df.iloc[[0, 1], [0, 1]]

        id   brand
0  2210000   HONDA
1  2210001  TOYOTA

In [25]:
df.loc[0]

id                                                            2210000
brand                                                           HONDA
series                                                           JAZZ
model                                              1.5 i-VTEC SV (AS)
gen                                                           ปี08-13
year                                                             2014
color                                                           สีขาว
gear                                                      เกียร์ออโต้
gas                                                               NaN
sales_price                                                   488,000
original_price                                                    NaN
market_price                                                      NaN
description         เครดิตดีออกรถ10,000จบครับ\nรับประกันเครื่องเกี...
contact_location                                             กรุงเทพฯ
subscribers                                                      1047
scraped_date                                               2019-05-22
removed_date                                                      NaN
Name: 0, dtype: object

In [26]:
df.loc[0:2, "id":"brand"]

        id   brand
0  2210000   HONDA
1  2210001  TOYOTA
2  2210009   HONDA

In [27]:
df.loc[[0, 1], ["id", "brand"]]

        id   brand
0  2210000   HONDA
1  2210001  TOYOTA

### Boolean Indexing

Series `ser` ที่มีค่าเท่ากับ 2

In [28]:
ser[ser == 2]

1    2
dtype: int64

Series `ser` ที่มีค่าน้อยกว่า 3

In [29]:
ser[ser < 3]

0    1
1    2
dtype: int64

รถยนต์ยี่ห้อ HONDA

In [30]:
df[df['brand'] == 'HONDA']

            id  brand  series  ... subscribers scraped_date  removed_date
0      2210000  HONDA    JAZZ  ...      1047.0   2019-05-22           NaN
2      2210009  HONDA    JAZZ  ...      1047.0   2019-05-22           NaN
8      2210029  HONDA  ACCORD  ...      1058.0   2019-05-22           NaN
18     2210053  HONDA    CITY  ...      1008.0   2019-05-22           NaN
23     2210066  HONDA    JAZZ  ...      1047.0   2019-05-22           NaN
...        ...    ...     ...  ...         ...          ...           ...
14005  2232850  HONDA    CITY  ...       564.0   2019-05-28           NaN
14008  2232853  HONDA     CRV  ...       423.0   2019-05-28           NaN
14032  2232877  HONDA   CIVIC  ...      1614.0   2019-05-28           NaN
14035  2232880  HONDA    JAZZ  ...       825.0   2019-05-28           NaN
14036  2232881  HONDA   CIVIC  ...      1147.0   2019-05-28           NaN

[2252 rows x 17 columns]

## Aggregation

การ aggregate ข้อมูลในรูปแบบต่างๆ ไม่ว่าจะเป็นการหาค่าเฉลี่ย, ค่าที่มากที่สุด, ค่าที่น้อยที่สุด รวมถึงการหาค่าที่เกิดบ่อยที่สุดและอื่นๆอีกด้วย

In [31]:
df2 = df[['sales_price', 'brand', 'market_price']]
df2.head()

  sales_price   brand market_price
0     488,000   HONDA          NaN
1   1,677,000  TOYOTA    3,050,000
2     338,000   HONDA          NaN
3     689,000    FORD      849,000
4     359,000  TOYOTA      649,000

การเช็ค data type ของข้อมูล

In [32]:
df2.dtypes

sales_price     object
brand           object
market_price    object
dtype: object

**ทำไม string ถึงถูกเก็บเป็น object?**

= เพราะว่าชนิดของข้อมูลใน DataFrame นั้นจริงๆแล้วมาจากชนิดของข้อมูลใน `ndarray` ทุกๆ element ใน `ndarray` นั้นจะต้องมีขนาดของ bytes ที่เท่ากัน ตัวอย่างเช่น `int64`, `float64` พวกมันนั้นมีขนาด 8 bytes หรือ 64 bits แต่สำหรับ string เนื่องจากความยาวของ string นั้นไม่ได้ถูก fixed ดังนั้นแทนที่มันจะเก็บ bytes ของ string ใน `ndarray` แบบตรงๆ Pandas จะใช้ object `ndarray` ในการเก็บแทน เพื่อที่มันจะบันทึกตัว pointers เพื่อชี้ไปยัง object นั้นๆแทน

![](https://i.stack.imgur.com/pFF44.png)

เนื่องจาก `sales_price` ถูกเก็บเป็น object หรือ string อยู่ จึงไม่สามารถที่จะหาค่าเฉลี่ยของราคารถที่ถูกขายอยู่ได้

In [33]:
df2['sales_price'].mean()

TypeError: ignored

เพราะฉะนั้นสิ่งแรกที่ควรทำคือการแปลง data type จาก object ให้กลายมาเป็น integer แต่เรื่องจากในข้อมูลของเรานั้นมี `,` คั่นอยู่ระหว่างตัวเลข สิ่งแรกที่ควรทำเลยก็คือการลบ `,` ออกไป แล้วจึงค่อยแปลงเป็นตัวเลข [Working with text data](https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html)

In [35]:
df2['sales_price'].astype(int)

ValueError: ignored

In [36]:
df2['sales_price'] = df2['sales_price'].str.replace(',', '') # Delete ,
df2['sales_price'] = df2['sales_price'].astype(int)
print(df2.dtypes)
df2.head()

sales_price      int64
brand           object
market_price    object
dtype: object

   sales_price   brand market_price
0       488000   HONDA          NaN
1      1677000  TOYOTA    3,050,000
2       338000   HONDA          NaN
3       689000    FORD      849,000
4       359000  TOYOTA      649,000

### Numerical Data

ในการหา descriptive statistics เราสามารถใช้ function ที่ต้องการโดยตรงเลยหรือใช้ `describe()` ก็ได้ โดยใน `describe()` นั้น ก็จะมีบอกค่าทางสถิิติในรูปแบบต่างๆ ทั้ง ค่าเฉลี่ย, ส่วนเบี่ยงเบนมาตรฐาน, ค่าน้อยที่สุด, ค่ามากที่สุดและรวมถึงค่า percentile ต่างๆอีกด้วย

In [37]:
print(f"Lowest sales price: {df2['sales_price'].min()}")
print(f"Highest sales price: {df2['sales_price'].max()}")
print(f"Average sales price: {df2['sales_price'].mean()}")
print(f"Median sales price: {df2['sales_price'].median()}")

Lowest sales price: 20000
Highest sales price: 55000000
Average sales price: 606793.1894279404
Median sales price: 413000.0

In [38]:
df2['sales_price'].describe()

count    1.403700e+04
mean     6.067932e+05
std      8.720579e+05
min      2.000000e+04
25%      2.790000e+05
50%      4.130000e+05
75%      6.480000e+05
max      5.500000e+07
Name: sales_price, dtype: float64

### Categorical Data

ในส่วนของ categorical data เราก็จะสามารถหา unique value ของ category ได้ รวมทั้งจำนวนครั้งที่ category นั้นมีอยู่ใน data ของเรา

In [39]:
df2['brand']

0         HONDA
1        TOYOTA
2         HONDA
3          FORD
4        TOYOTA
          ...
14032     HONDA
14033    TOYOTA
14034    TOYOTA
14035     HONDA
14036     HONDA
Name: brand, Length: 14037, dtype: object

In [40]:
df2['brand'].unique()

array(['HONDA', 'TOYOTA', 'FORD', 'VOLKSWAGEN', 'CHEVROLET', 'VOLVO',
       'AUDI', 'ISUZU', 'NISSAN', 'BMW', 'BENZ', 'SUZUKI', 'LEXUS',
       'PORSCHE', 'SUBARU', 'MITSUBISHI', 'MAZDA', 'MG', 'SAAB',
       'LANDROVER', 'PEUGEOT', 'JAGUAR', 'MINI', 'HYUNDAI', 'THAI RUNG',
       'PROTON', 'KIA', 'HINO', 'TATA', 'FIAT', 'JEEP', 'SEAT',
       'LAMBORGHINI', 'SKODA', 'ROVER', 'SSANGYONG', 'MASERATI',
       'DAIHATSU', 'CITROEN', 'DFSK', 'FERRARI', 'ASTON MARTIN',
       'BENTLEY', 'ALFA ROMEO', 'LOTUS', 'FOTON', 'HUMMER', 'CHERY',
       'MITSUOKA'], dtype=object)

In [41]:
df2['brand'].nunique()

49

In [42]:
df2['brand'].value_counts().head()

TOYOTA    4227
HONDA     2252
NISSAN    1055
ISUZU     1050
BENZ      1036
Name: brand, dtype: int64

### Categorical & Numerical Data

เราสามารถจัดกลุ่มของ category ต่างๆโดยคำสั่ง `groupby()` [Group by: split-apply-combine](https://pandas.pydata.org/docs/user_guide/groupby.html) เพื่อที่จะสามารถหาค่าต่างๆในแต่ละกลุ่มได้ ไม่ว่าจะเป็นค่าเฉลี่ยของราคาขายรถแต่ละยี่ห้อ, ค่าที่มากที่สุด, ค่าที่น้อยที่สุดที่รถยี่ห้อนั้นๆถูกขายอยู่ในท้องตลาด

In [43]:
df2.groupby(['brand'])['sales_price'].max().head()

brand
ALFA ROMEO        455000
ASTON MARTIN     6900000
AUDI             8390000
BENTLEY         13800000
BENZ            12800000
Name: sales_price, dtype: int64

In [44]:
df2.groupby(['brand'])['sales_price'].min().head()

brand
ALFA ROMEO       256000
ASTON MARTIN    6900000
AUDI              88000
BENTLEY         5800000
BENZ              28000
Name: sales_price, dtype: int64

In [45]:
df2.groupby(['brand'])['sales_price'].mean().head()

brand
ALFA ROMEO      3.555000e+05
ASTON MARTIN    6.900000e+06
AUDI            1.594739e+06
BENTLEY         9.100000e+06
BENZ            1.295657e+06
Name: sales_price, dtype: float64

ถ้าเราอยากรู้ว่าโดยเฉลี่ยแล้ว รถยี่ห้อไหนมีราคาขายแพงที่สุด เราก็จะสามารถทำได้โดยการ `groupby()` แล้วหาค่าเฉลี่ยของราคาขายรถแต่ละยี่ห้อ แล้วจึงเรียงลำดับค่าจากมากไปน้อย

In [46]:
price_mean = df2.groupby(['brand'])['sales_price'].mean()
price_mean.head()

brand
ALFA ROMEO      3.555000e+05
ASTON MARTIN    6.900000e+06
AUDI            1.594739e+06
BENTLEY         9.100000e+06
BENZ            1.295657e+06
Name: sales_price, dtype: float64

In [47]:
price_mean.sort_values(ascending=False).head()

brand
FERRARI         1.448333e+07
BENTLEY         9.100000e+06
LAMBORGHINI     7.796667e+06
ASTON MARTIN    6.900000e+06
MASERATI        5.990000e+06
Name: sales_price, dtype: float64

**แล้วใครกันที่ขายรถถูกกว่าราคาตลาด?**

= สิ่งที่เราต้องทำก็คือการเทียบราคาขายของรถนั้นๆกับราคาตลาด เพื่อดูว่าผู้ขายคนไหนที่ขายรถถูกกว่าราคาตลาด

In [48]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14037 entries, 0 to 14036
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sales_price   14037 non-null  int64
 1   brand         14037 non-null  object
 2   market_price  6153 non-null   object
dtypes: int64(1), object(2)
memory usage: 329.1+ KB

เนื่องจากรถทุกยี่ห้อไม่ได้มีราคาตลาดให้ทำการเปรียบเทียบ เราจึงไม่สนใจรถยี่ห้อนั้นๆ เพราะเราจะไม่มีทางรู้ได้เลยว่ามันถูกกว่าหรือแพงกว่าราคาตลาด เราจึงทำการลบข้อมูลแถวนั้นออกไป โดยใช้คำสั่ง `dropna()`

In [49]:
price_df = df2[['sales_price', 'market_price']].dropna()
price_df

       sales_price market_price
1          1677000    3,050,000
3           689000      849,000
4           359000      649,000
6           459000      829,000
10          388000      699,000
...            ...          ...
14022       389000      682,000
14023       899000    1,541,000
14030      2590000    6,650,000
14033       530000    1,299,000
14036       976000    1,190,000

[6153 rows x 2 columns]

เราจะได้เห็นได้ว่าหลังจากเราลบข้อมูลแถวที่ไม่มีราคาตลาดออกไปแล้ว ตัว `index` ของ DataFrame มันยังคงจำ `index` เดิมอยู่ เราจึงต้องทำการรีเซ็ทค่าของมันโดยใช้คำสั่ง `reset_index()`

In [50]:
price_df.reset_index()

      index  sales_price market_price
0         1      1677000    3,050,000
1         3       689000      849,000
2         4       359000      649,000
3         6       459000      829,000
4        10       388000      699,000
...     ...          ...          ...
6148  14022       389000      682,000
6149  14023       899000    1,541,000
6150  14030      2590000    6,650,000
6151  14033       530000    1,299,000
6152  14036       976000    1,190,000

[6153 rows x 3 columns]

In [51]:
price_df = price_df.reset_index(drop=True)
price_df

      sales_price market_price
0         1677000    3,050,000
1          689000      849,000
2          359000      649,000
3          459000      829,000
4          388000      699,000
...           ...          ...
6148       389000      682,000
6149       899000    1,541,000
6150      2590000    6,650,000
6151       530000    1,299,000
6152       976000    1,190,000

[6153 rows x 2 columns]

In [52]:
price_df['market_price'] = price_df['market_price'].str.replace(',', '').astype(int)
print(price_df.dtypes)
price_df.head()

sales_price     int64
market_price    int64
dtype: object

   sales_price  market_price
0      1677000       3050000
1       689000        849000
2       359000        649000
3       459000        829000
4       388000        699000

และเนื่องจากลูกค้าที่จะมาซื้อรถเป็นลูกค้าต่างชาติ เพราะฉะนั้นเราจึงต้องแปลงราคาขายของรถจากเงินบาทให้เป็นเงินดอลลาร์ โดยการสร้าง function `thb_to_usd` ขึ้นมาและใช้ `map()` หรือ `apply()` ในการนำ DataFrame หรือ Series นั้นมาเข้าสู่ function ที่ได้สร้างไว้

In [53]:
def thb_to_usd(thb):
  usd = thb / 30
  return usd

In [54]:
price_df['sales_price'].map(thb_to_usd)

0       55900.000000
1       22966.666667
2       11966.666667
3       15300.000000
4       12933.333333
            ...
6148    12966.666667
6149    29966.666667
6150    86333.333333
6151    17666.666667
6152    32533.333333
Name: sales_price, Length: 6153, dtype: float64

In [55]:
price_df['market_price'].map(thb_to_usd)

0       101666.666667
1        28300.000000
2        21633.333333
3        27633.333333
4        23300.000000
            ...
6148     22733.333333
6149     51366.666667
6150    221666.666667
6151     43300.000000
6152     39666.666667
Name: market_price, Length: 6153, dtype: float64

In [57]:
price_df.map(thb_to_usd)

AttributeError: ignored

In [58]:
price_df.apply(thb_to_usd)

       sales_price   market_price
0     55900.000000  101666.666667
1     22966.666667   28300.000000
2     11966.666667   21633.333333
3     15300.000000   27633.333333
4     12933.333333   23300.000000
...            ...            ...
6148  12966.666667   22733.333333
6149  29966.666667   51366.666667
6150  86333.333333  221666.666667
6151  17666.666667   43300.000000
6152  32533.333333   39666.666667

[6153 rows x 2 columns]

จากโค้ดข้างบนจะเห็นได้ว่าทั้ง `map()` และ `apply()` สามารถนำข้อมูลที่มีเข้าสู่ function ได้ แต่ข้อแตกต่างที่สำคัญระหว่าง 2 ตัวนี้คือ `apply()` นั้น จะสามารถใช้ได้กับทั้ง Series และ DataFrame ในขณะที่ `map()` นั้่นจะสามารถใช้ได้กับ Series เท่านั้น

และสิ่งสุดท้ายที่เราต้องการคือการหาความแตกต่างระหว่างราคาตลาดและราคาขายของรถ เราจึงสามารถใช้ `apply()` ได้ และเราจะใช้ `lambda` function เข้ามาช่วย โดยตัว `lambda` function นั้น เปรียบเสมือน function ขนาดเล็กที่ไม่ต้องมีการกำหนดชื่อของ function

![](https://github.com/opalchonlapat/sample-data/blob/master/img/1554612772628.jpg?raw=true)

In [59]:
price_df.apply(lambda x: x['market_price'] - x['sales_price'], axis=1)

0       1373000
1        160000
2        290000
3        370000
4        311000
         ...
6148     293000
6149     642000
6150    4060000
6151     769000
6152     214000
Length: 6153, dtype: int64

In [60]:
def find_diff_price(x):
  return x['market_price'] - x['sales_price']

In [61]:
price_df.apply(find_diff_price, axis=1)

0       1373000
1        160000
2        290000
3        370000
4        311000
         ...
6148     293000
6149     642000
6150    4060000
6151     769000
6152     214000
Length: 6153, dtype: int64

## Analyze data

ข้อมูลที่เราจะนำมาวิเคราะห์ในนี้คือข้อมูลของ species ของดอก iris โดยหลักๆจะมี 3 species คือ setosa, versicolor, และ virginica โดยแต่ละประเภทก็จะมีความยาว `length` และความกว้าง `width` ของกลีบเลี้ยง `sepal` และกลีบดอก `petal` ที่แตกต่างกันไป

![](https://miro.medium.com/max/2000/0*_WfmSKzMX-u_xVyc.png)

In [62]:
iris = pd.read_csv('https://gist.githubusercontent.com/curran/a08a1080b88344b0c8a7/raw/0e7a9b0a5d22642a06d3d5b9bcbad9890c8ee534/iris.csv')

In [63]:
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

### Question:
1. ค่าเฉลี่ยของความยาวและความกว้างของกลีบเลี้ยงคือเท่าไหร่ ?
2. กลีบดอกมีความยาวและความกว้่างมากที่สุดเท่าไหร่ ?
3. ดอกไม้ species ไหน มีจำนวนเยอะที่สุด ?
4. แต่ละ species มีค่าเฉลี่ยความยาวและความกว้างของกลีบเลี้ยงคือเท่าไหร่ ?